tutorials/untested/reactInPoresV1/0.org/N2Mass
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      CO;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.8;
//~ internalField   uniform 0.01;

boundaryField
{
    inletY
    {
        type            fixedValue;
        value           uniform 0.8;
    }

    // "(inletX|inletZ|outletX|outletZ)"
    "(inletX|inletZ|outletX|outletZ|walls)"
    {
        type            zeroGradient;
    }
    // "(walls|outletY)"
    "(outletY)"
    {
        type            fixedValue;
        value           uniform 1.0;
    }

}

// ************************************************************************* //
