tutorials/untested/reactInPoresV1/0.org/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

//~internalField   uniform 873;
internalField   uniform 328;

boundaryField
{
    inletY
    {
        type            fixedValue;
        value           uniform 328;
    }

    "(inletX|inletZ|outletX|outletZ|outletY|walls)"
    {
        type            zeroGradient;
    }
}
